layer {
  name: "data_0"
  type: "Data"
  top: "data_0"
  top: "label_0"
  include {
    phase: TEST
  }
  transform_param {
    mirror: false
    crop_size: 48
    mean_value: 106
    mean_value: 103
    mean_value: 123
  }
  data_param {
    source: "../local_data/lmdb/rtsd-r1/orig/test/lmdb"
    batch_size: 150
    backend: LMDB
  }
}
layer {
  name: "conv0_0"
  type: "Convolution"
  bottom: "data_0"
  top: "conv0_0"
  convolution_param {
    num_output: 100
    pad: 0
    kernel_size: 7
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "conv0_0_prescale"
  type: "Scale"
  bottom: "conv0_0"
  top: "conv0_0"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 0.6666
    }
  }
}
layer {
  name: "conv0_0_sTanH"
  type: "TanH"
  bottom: "conv0_0"
  top: "conv0_0"
}
layer {
  name: "conv0_0_postscale"
  type: "Scale"
  bottom: "conv0_0"
  top: "conv0_0"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1.7159
    }
  }
}
layer {
  name: "pool0_0"
  type: "Pooling"
  bottom: "conv0_0"
  top: "pool0_0"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv0_1"
  type: "Convolution"
  bottom: "pool0_0"
  top: "conv0_1"
  convolution_param {
    num_output: 150
    pad: 0
    kernel_size: 4
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "conv0_1_prescale"
  type: "Scale"
  bottom: "conv0_1"
  top: "conv0_1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 0.6666
    }
  }
}
layer {
  name: "conv0_1_sTanH"
  type: "TanH"
  bottom: "conv0_1"
  top: "conv0_1"
}
layer {
  name: "conv0_1_postscale"
  type: "Scale"
  bottom: "conv0_1"
  top: "conv0_1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1.7159
    }
  }
}
layer {
  name: "pool0_1"
  type: "Pooling"
  bottom: "conv0_1"
  top: "pool0_1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv0_2"
  type: "Convolution"
  bottom: "pool0_1"
  top: "conv0_2"
  convolution_param {
    num_output: 250
    pad: 0
    kernel_size: 4
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "conv0_2_prescale"
  type: "Scale"
  bottom: "conv0_2"
  top: "conv0_2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 0.6666
    }
  }
}
layer {
  name: "conv0_2_sTanH"
  type: "TanH"
  bottom: "conv0_2"
  top: "conv0_2"
}
layer {
  name: "conv0_2_postscale"
  type: "Scale"
  bottom: "conv0_2"
  top: "conv0_2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1.7159
    }
  }
}
layer {
  name: "pool0_2"
  type: "Pooling"
  bottom: "conv0_2"
  top: "pool0_2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "fc0_4_300"
  type: "InnerProduct"
  bottom: "pool0_2"
  top: "fc0_4"
  inner_product_param {
    num_output: 300
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fc0_4_prescale"
  type: "Scale"
  bottom: "fc0_4"
  top: "fc0_4"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 0.6666
    }
  }
}
layer {
  name: "fc0_4_sTanH"
  type: "TanH"
  bottom: "fc0_4"
  top: "fc0_4"
}
layer {
  name: "fc0_4_postscale"
  type: "Scale"
  bottom: "fc0_4"
  top: "fc0_4"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1.7159
    }
  }
}
layer {
  name: "drop0_4"
  type: "Dropout"
  bottom: "fc0_4"
  top: "fc0_4"
  dropout_param {
    dropout_ratio: 0.4
  }
}
layer {
  name: "fc0_5_67"
  type: "InnerProduct"
  bottom: "fc0_4"
  top: "fc0_5"
  inner_product_param {
    num_output: 67
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "softmax_0"
  type: "Softmax"
  bottom: "fc0_5"
  top: "softmax_0"
}
layer {
  name: "data_1"
  type: "Data"
  top: "data_1"
  top: "label_1"
  include {
    phase: TEST
  }
  transform_param {
    mirror: false
    crop_size: 48
    mean_value: 117
    mean_value: 114
    mean_value: 133
  }
  data_param {
    source: "../local_data/lmdb/rtsd-r1/histeq/test/lmdb"
    batch_size: 150
    backend: LMDB
  }
}
layer {
  name: "conv1_0"
  type: "Convolution"
  bottom: "data_1"
  top: "conv1_0"
  convolution_param {
    num_output: 100
    pad: 0
    kernel_size: 7
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "conv1_0_prescale"
  type: "Scale"
  bottom: "conv1_0"
  top: "conv1_0"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 0.6666
    }
  }
}
layer {
  name: "conv1_0_sTanH"
  type: "TanH"
  bottom: "conv1_0"
  top: "conv1_0"
}
layer {
  name: "conv1_0_postscale"
  type: "Scale"
  bottom: "conv1_0"
  top: "conv1_0"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1.7159
    }
  }
}
layer {
  name: "pool1_0"
  type: "Pooling"
  bottom: "conv1_0"
  top: "pool1_0"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv1_1"
  type: "Convolution"
  bottom: "pool1_0"
  top: "conv1_1"
  convolution_param {
    num_output: 150
    pad: 0
    kernel_size: 4
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "conv1_1_prescale"
  type: "Scale"
  bottom: "conv1_1"
  top: "conv1_1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 0.6666
    }
  }
}
layer {
  name: "conv1_1_sTanH"
  type: "TanH"
  bottom: "conv1_1"
  top: "conv1_1"
}
layer {
  name: "conv1_1_postscale"
  type: "Scale"
  bottom: "conv1_1"
  top: "conv1_1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1.7159
    }
  }
}
layer {
  name: "pool1_1"
  type: "Pooling"
  bottom: "conv1_1"
  top: "pool1_1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv1_2"
  type: "Convolution"
  bottom: "pool1_1"
  top: "conv1_2"
  convolution_param {
    num_output: 250
    pad: 0
    kernel_size: 4
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "conv1_2_prescale"
  type: "Scale"
  bottom: "conv1_2"
  top: "conv1_2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 0.6666
    }
  }
}
layer {
  name: "conv1_2_sTanH"
  type: "TanH"
  bottom: "conv1_2"
  top: "conv1_2"
}
layer {
  name: "conv1_2_postscale"
  type: "Scale"
  bottom: "conv1_2"
  top: "conv1_2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1.7159
    }
  }
}
layer {
  name: "pool1_2"
  type: "Pooling"
  bottom: "conv1_2"
  top: "pool1_2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "fc1_4_300"
  type: "InnerProduct"
  bottom: "pool1_2"
  top: "fc1_4"
  inner_product_param {
    num_output: 300
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fc1_4_prescale"
  type: "Scale"
  bottom: "fc1_4"
  top: "fc1_4"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 0.6666
    }
  }
}
layer {
  name: "fc1_4_sTanH"
  type: "TanH"
  bottom: "fc1_4"
  top: "fc1_4"
}
layer {
  name: "fc1_4_postscale"
  type: "Scale"
  bottom: "fc1_4"
  top: "fc1_4"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1.7159
    }
  }
}
layer {
  name: "drop1_4"
  type: "Dropout"
  bottom: "fc1_4"
  top: "fc1_4"
  dropout_param {
    dropout_ratio: 0.4
  }
}
layer {
  name: "fc1_5_67"
  type: "InnerProduct"
  bottom: "fc1_4"
  top: "fc1_5"
  inner_product_param {
    num_output: 67
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "softmax_1"
  type: "Softmax"
  bottom: "fc1_5"
  top: "softmax_1"
}
layer {
  name: "data_2"
  type: "Data"
  top: "data_2"
  top: "label_2"
  include {
    phase: TEST
  }
  transform_param {
    mirror: false
    crop_size: 48
    mean_value: 119
    mean_value: 116
    mean_value: 136
  }
  data_param {
    source: "../local_data/lmdb/rtsd-r1/AHE/test/lmdb"
    batch_size: 150
    backend: LMDB
  }
}
layer {
  name: "conv2_0"
  type: "Convolution"
  bottom: "data_2"
  top: "conv2_0"
  convolution_param {
    num_output: 100
    pad: 0
    kernel_size: 7
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "conv2_0_prescale"
  type: "Scale"
  bottom: "conv2_0"
  top: "conv2_0"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 0.6666
    }
  }
}
layer {
  name: "conv2_0_sTanH"
  type: "TanH"
  bottom: "conv2_0"
  top: "conv2_0"
}
layer {
  name: "conv2_0_postscale"
  type: "Scale"
  bottom: "conv2_0"
  top: "conv2_0"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1.7159
    }
  }
}
layer {
  name: "pool2_0"
  type: "Pooling"
  bottom: "conv2_0"
  top: "pool2_0"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv2_1"
  type: "Convolution"
  bottom: "pool2_0"
  top: "conv2_1"
  convolution_param {
    num_output: 150
    pad: 0
    kernel_size: 4
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "conv2_1_prescale"
  type: "Scale"
  bottom: "conv2_1"
  top: "conv2_1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 0.6666
    }
  }
}
layer {
  name: "conv2_1_sTanH"
  type: "TanH"
  bottom: "conv2_1"
  top: "conv2_1"
}
layer {
  name: "conv2_1_postscale"
  type: "Scale"
  bottom: "conv2_1"
  top: "conv2_1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1.7159
    }
  }
}
layer {
  name: "pool2_1"
  type: "Pooling"
  bottom: "conv2_1"
  top: "pool2_1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv2_2"
  type: "Convolution"
  bottom: "pool2_1"
  top: "conv2_2"
  convolution_param {
    num_output: 250
    pad: 0
    kernel_size: 4
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "conv2_2_prescale"
  type: "Scale"
  bottom: "conv2_2"
  top: "conv2_2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 0.6666
    }
  }
}
layer {
  name: "conv2_2_sTanH"
  type: "TanH"
  bottom: "conv2_2"
  top: "conv2_2"
}
layer {
  name: "conv2_2_postscale"
  type: "Scale"
  bottom: "conv2_2"
  top: "conv2_2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1.7159
    }
  }
}
layer {
  name: "pool2_2"
  type: "Pooling"
  bottom: "conv2_2"
  top: "pool2_2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "fc2_4_300"
  type: "InnerProduct"
  bottom: "pool2_2"
  top: "fc2_4"
  inner_product_param {
    num_output: 300
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fc2_4_prescale"
  type: "Scale"
  bottom: "fc2_4"
  top: "fc2_4"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 0.6666
    }
  }
}
layer {
  name: "fc2_4_sTanH"
  type: "TanH"
  bottom: "fc2_4"
  top: "fc2_4"
}
layer {
  name: "fc2_4_postscale"
  type: "Scale"
  bottom: "fc2_4"
  top: "fc2_4"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1.7159
    }
  }
}
layer {
  name: "drop2_4"
  type: "Dropout"
  bottom: "fc2_4"
  top: "fc2_4"
  dropout_param {
    dropout_ratio: 0.4
  }
}
layer {
  name: "fc2_5_67"
  type: "InnerProduct"
  bottom: "fc2_4"
  top: "fc2_5"
  inner_product_param {
    num_output: 67
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "softmax_2"
  type: "Softmax"
  bottom: "fc2_5"
  top: "softmax_2"
}
layer {
  name: "data_3"
  type: "Data"
  top: "data_3"
  top: "label_3"
  include {
    phase: TEST
  }
  transform_param {
    mirror: false
    crop_size: 48
    mean_value: 102
    mean_value: 99
    mean_value: 118
  }
  data_param {
    source: "../local_data/lmdb/rtsd-r1/imajust/test/lmdb"
    batch_size: 150
    backend: LMDB
  }
}
layer {
  name: "conv3_0"
  type: "Convolution"
  bottom: "data_3"
  top: "conv3_0"
  convolution_param {
    num_output: 100
    pad: 0
    kernel_size: 7
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "conv3_0_prescale"
  type: "Scale"
  bottom: "conv3_0"
  top: "conv3_0"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 0.6666
    }
  }
}
layer {
  name: "conv3_0_sTanH"
  type: "TanH"
  bottom: "conv3_0"
  top: "conv3_0"
}
layer {
  name: "conv3_0_postscale"
  type: "Scale"
  bottom: "conv3_0"
  top: "conv3_0"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1.7159
    }
  }
}
layer {
  name: "pool3_0"
  type: "Pooling"
  bottom: "conv3_0"
  top: "pool3_0"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv3_1"
  type: "Convolution"
  bottom: "pool3_0"
  top: "conv3_1"
  convolution_param {
    num_output: 150
    pad: 0
    kernel_size: 4
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "conv3_1_prescale"
  type: "Scale"
  bottom: "conv3_1"
  top: "conv3_1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 0.6666
    }
  }
}
layer {
  name: "conv3_1_sTanH"
  type: "TanH"
  bottom: "conv3_1"
  top: "conv3_1"
}
layer {
  name: "conv3_1_postscale"
  type: "Scale"
  bottom: "conv3_1"
  top: "conv3_1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1.7159
    }
  }
}
layer {
  name: "pool3_1"
  type: "Pooling"
  bottom: "conv3_1"
  top: "pool3_1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv3_2"
  type: "Convolution"
  bottom: "pool3_1"
  top: "conv3_2"
  convolution_param {
    num_output: 250
    pad: 0
    kernel_size: 4
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "conv3_2_prescale"
  type: "Scale"
  bottom: "conv3_2"
  top: "conv3_2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 0.6666
    }
  }
}
layer {
  name: "conv3_2_sTanH"
  type: "TanH"
  bottom: "conv3_2"
  top: "conv3_2"
}
layer {
  name: "conv3_2_postscale"
  type: "Scale"
  bottom: "conv3_2"
  top: "conv3_2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1.7159
    }
  }
}
layer {
  name: "pool3_2"
  type: "Pooling"
  bottom: "conv3_2"
  top: "pool3_2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "fc3_4_300"
  type: "InnerProduct"
  bottom: "pool3_2"
  top: "fc3_4"
  inner_product_param {
    num_output: 300
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fc3_4_prescale"
  type: "Scale"
  bottom: "fc3_4"
  top: "fc3_4"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 0.6666
    }
  }
}
layer {
  name: "fc3_4_sTanH"
  type: "TanH"
  bottom: "fc3_4"
  top: "fc3_4"
}
layer {
  name: "fc3_4_postscale"
  type: "Scale"
  bottom: "fc3_4"
  top: "fc3_4"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1.7159
    }
  }
}
layer {
  name: "drop3_4"
  type: "Dropout"
  bottom: "fc3_4"
  top: "fc3_4"
  dropout_param {
    dropout_ratio: 0.4
  }
}
layer {
  name: "fc3_5_67"
  type: "InnerProduct"
  bottom: "fc3_4"
  top: "fc3_5"
  inner_product_param {
    num_output: 67
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "softmax_3"
  type: "Softmax"
  bottom: "fc3_5"
  top: "softmax_3"
}
layer {
  name: "data_4"
  type: "Data"
  top: "data_4"
  top: "label_4"
  include {
    phase: TEST
  }
  transform_param {
    mirror: false
    crop_size: 48
    mean_value: 124
    mean_value: 124
    mean_value: 124
  }
  data_param {
    source: "../local_data/lmdb/rtsd-r1/CoNorm/test/lmdb"
    batch_size: 150
    backend: LMDB
  }
}
layer {
  name: "conv4_0"
  type: "Convolution"
  bottom: "data_4"
  top: "conv4_0"
  convolution_param {
    num_output: 100
    pad: 0
    kernel_size: 7
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "conv4_0_prescale"
  type: "Scale"
  bottom: "conv4_0"
  top: "conv4_0"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 0.6666
    }
  }
}
layer {
  name: "conv4_0_sTanH"
  type: "TanH"
  bottom: "conv4_0"
  top: "conv4_0"
}
layer {
  name: "conv4_0_postscale"
  type: "Scale"
  bottom: "conv4_0"
  top: "conv4_0"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1.7159
    }
  }
}
layer {
  name: "pool4_0"
  type: "Pooling"
  bottom: "conv4_0"
  top: "pool4_0"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv4_1"
  type: "Convolution"
  bottom: "pool4_0"
  top: "conv4_1"
  convolution_param {
    num_output: 150
    pad: 0
    kernel_size: 4
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "conv4_1_prescale"
  type: "Scale"
  bottom: "conv4_1"
  top: "conv4_1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 0.6666
    }
  }
}
layer {
  name: "conv4_1_sTanH"
  type: "TanH"
  bottom: "conv4_1"
  top: "conv4_1"
}
layer {
  name: "conv4_1_postscale"
  type: "Scale"
  bottom: "conv4_1"
  top: "conv4_1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1.7159
    }
  }
}
layer {
  name: "pool4_1"
  type: "Pooling"
  bottom: "conv4_1"
  top: "pool4_1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv4_2"
  type: "Convolution"
  bottom: "pool4_1"
  top: "conv4_2"
  convolution_param {
    num_output: 250
    pad: 0
    kernel_size: 4
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "conv4_2_prescale"
  type: "Scale"
  bottom: "conv4_2"
  top: "conv4_2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 0.6666
    }
  }
}
layer {
  name: "conv4_2_sTanH"
  type: "TanH"
  bottom: "conv4_2"
  top: "conv4_2"
}
layer {
  name: "conv4_2_postscale"
  type: "Scale"
  bottom: "conv4_2"
  top: "conv4_2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1.7159
    }
  }
}
layer {
  name: "pool4_2"
  type: "Pooling"
  bottom: "conv4_2"
  top: "pool4_2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "fc4_4_300"
  type: "InnerProduct"
  bottom: "pool4_2"
  top: "fc4_4"
  inner_product_param {
    num_output: 300
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fc4_4_prescale"
  type: "Scale"
  bottom: "fc4_4"
  top: "fc4_4"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 0.6666
    }
  }
}
layer {
  name: "fc4_4_sTanH"
  type: "TanH"
  bottom: "fc4_4"
  top: "fc4_4"
}
layer {
  name: "fc4_4_postscale"
  type: "Scale"
  bottom: "fc4_4"
  top: "fc4_4"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1.7159
    }
  }
}
layer {
  name: "drop4_4"
  type: "Dropout"
  bottom: "fc4_4"
  top: "fc4_4"
  dropout_param {
    dropout_ratio: 0.4
  }
}
layer {
  name: "fc4_5_67"
  type: "InnerProduct"
  bottom: "fc4_4"
  top: "fc4_5"
  inner_product_param {
    num_output: 67
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "softmax_4"
  type: "Softmax"
  bottom: "fc4_5"
  top: "softmax_4"
}
layer {
  name: "averaging"
  type: "Eltwise"
  bottom: "softmax_0"
  bottom: "softmax_1"
  bottom: "softmax_2"
  bottom: "softmax_3"
  bottom: "softmax_4"
  top: "eltwize"
  eltwise_param {
    operation: SUM
    coeff: 0.2
    coeff: 0.2
    coeff: 0.2
    coeff: 0.2
    coeff: 0.2
  }
}
layer {
  name: "loss"
  type: "MultinomialLogisticLoss"
  bottom: "eltwize"
  bottom: "label_0"
  top: "loss"
}
layer {
  name: "accuracy_1"
  type: "Accuracy"
  bottom: "eltwize"
  bottom: "label_0"
  top: "accuracy_1"
  include {
    phase: TEST
  }
  accuracy_param {
    top_k: 1
  }
}
layer {
  name: "accuracy_5"
  type: "Accuracy"
  bottom: "eltwize"
  bottom: "label_0"
  top: "accuracy_5"
  include {
    phase: TEST
  }
  accuracy_param {
    top_k: 5
  }
}
layer {
  name: "silence"
  type: "Silence"
  bottom: "label_1"
  bottom: "label_2"
  bottom: "label_3"
  bottom: "label_4"
}
